working with csv file

In [20]:
with open("Students.csv",mode="r") as file:
    data = file.read() # reading as text file
    print(data)

Name,Course,Address
Ram,Python,Kathmandu
Hari,Cyber,Lalitpur
Sita,DM,Kathmandu

In [21]:
#reading csv file
import csv
with open("Students.csv",mode="r", newline="") as file:
    csv_reader = csv.reader(file)
    for row in csv_reader:
        print(row)

['Name', 'Course', 'Address']
['Ram', 'Python', 'Kathmandu']
['Hari', 'Cyber', 'Lalitpur']
['Sita', 'DM', 'Kathmandu']

In [22]:
#writing csv file
import csv
header = ["name", "Age", "Address"]
data = [
    ["Ram", 20, "KTM"],
    ["Hari", 25, "Baneshwor"],
    ["Gita", 28, "Gaushala"],
    ["Mukesh",30, "Banepa"],
    ["Rakesh",31, "Birtamod"],
    ["Suresh",32, "Parasi"],
    ["Mohan",33, "Kamalbinayak"],
    ["Mira",34, "Sarlahi"]
]

with open("users.csv", mode="w", newline="") as file:
    csv_writer = csv.writer(file)
    #writing headers
    csv_writer.writerow(header) 
    print("written header")
    csv_writer.writerows(data)
    print("written data successfully")

written header
written data successfully

Using Pandas

In [23]:
#! pip install pandas

In [24]:
import pandas as pd
df = pd.read_csv("users.csv")
df.head()

     name  Age    Address
0     Ram   20        KTM
1    Hari   25  Baneshwor
2    Gita   28   Gaushala
3  Mukesh   30     Banepa
4  Rakesh   31   Birtamod

In [25]:
df["Age"]

0    20
1    25
2    28
3    30
4    31
5    32
6    33
7    34
Name: Age, dtype: int64

In [26]:
new_df = df[df["Age"]>25]
print(new_df)

     name  Age       Address
2    Gita   28      Gaushala
3  Mukesh   30        Banepa
4  Rakesh   31      Birtamod
5  Suresh   32        Parasi
6   Mohan   33  Kamalbinayak
7    Mira   34       Sarlahi

In [27]:
df.describe()

             Age
count   8.000000
mean   29.125000
std     4.673252
min    20.000000
25%    27.250000
50%    30.500000
75%    32.250000
max    34.000000

In [28]:
md = df["Age"].median()
print("Median age", md)

Median age 30.5

In [29]:
sorted_df = df.sort_values("Age", ascending=True)
sorted_df

     name  Age       Address
0     Ram   20           KTM
1    Hari   25     Baneshwor
2    Gita   28      Gaushala
3  Mukesh   30        Banepa
4  Rakesh   31      Birtamod
5  Suresh   32        Parasi
6   Mohan   33  Kamalbinayak
7    Mira   34       Sarlahi

In [30]:
sum_of_age =df["Age"].sum()
print(sum_of_age)

233

In [31]:
sorted_df["New Age"] = df["Age"] + 5

In [32]:
sorted_df

     name  Age       Address  New Age
0     Ram   20           KTM       25
1    Hari   25     Baneshwor       30
2    Gita   28      Gaushala       33
3  Mukesh   30        Banepa       35
4  Rakesh   31      Birtamod       36
5  Suresh   32        Parasi       37
6   Mohan   33  Kamalbinayak       38
7    Mira   34       Sarlahi       39

In [1]:
sorted_df.to_csv("updated_users.csv", index=False)

NameError: name 'sorted_df' is not defined

In [ ]:
numpy